{
  "MainWindow": {},
  "Importer": {
    "le_rootdir": "Specify the filepath to the root folder of your study.\nFor example: /home/jsmith/MyStudy/source",
    "chk_uselegacy": "Specify whether the legacy import should be used (CHECKED)\nOR whether the newer BIDS import should be used (UNCHECKED)",
    "lab_holdersub": "This label tells the importer that a directory level contains subject information\nA subject is a person or animal participating in the study",
    "lab_holdervisit": "This label tells the importer that a directory level contains visit information.\nA visit is a logical grouping of neuroimaging data acquired during the presence of\na subject at the site of the study (i.e baseline, 1-year followup, etc.)",
    "lab_holderrun": "This label tells the importer that a directory level contains run information.\nA run is an uninterrupted repetition of data acquisition with the same parameters\nduring a visit",
    "lab_holderscan": "This label tells the importer that a directory level contains scan information.\nA scan is an acquisition of neuroimaging data at using particular scanner machine\nparameters (i.e arterial spin labelling, T1-weighted imaging, etc.)",
    "lab_holderdummy": "This label tells the importer that a directory level contains no important information\nand that this level should be skipped over when discerning folder structure",
    "cmb_runposition": "Indicates the relative positioning this run has relative to the others in the event that run order is important to the study",
    "le_runalias": "Indicates the run name that the folder indicated on the left should take on after being\nimported. If not specified, the name of this folder will be ASL_"
  },
  "Dehybridizer": {
    "le_rootdir": "The path to the root directory that will have a backup made prior to an expansion\nand which tells the program where to begin looking.",
    "btn_setrootdir": "Specify the path to the root directory through a file dialogue rather than by\ndrag and drop",
    "le_exampledir": "Specify any directory that is an example of what must be expanded. This tells\nthe program the relative folder depth at which sibling folders can be found",
    "btn_exampledir": "Specify the path to the example directory through a file dialogue rather than\nby drag and drop",
    "le_delimiter": "Specify whether there is a character that separates two pieces of information\nfound at the indicated directory. For example subject_session is separated by\n '_' delimiter",
    "btn_fill_spaces": "Click to extract all relevant folder names at the indicated level,\nseparating names as appropriate if a delimiter was specified",
    "le_autofill": "Enter text in this field that you wish to be present in all rows.",
    "name2le": "Specify the name of the parent folder that the indicated\nchild folder should be placed under"
  },
  "ParmsMaker": {
    "le_easl_dir": "Specify the filepath to the ExploreASL folder located on your machine.\nExample: /home/jsmith/MATLAB/ExploreASL",
    "le_studyname": "Specify the name of the study you would like it to have",
    "chk_overwrite_for_bids": "Specify whether the study dataset is in BIDS format (CHECKED)\nOR whether the study dataset is in the older legacy format (UNCHECKED)",
    "le_study_dir": "Specify the filepath to the raw folder of your study.\nFor example: /home/jsmith/MyStudy/derivatives",
    "lst_included_subjects": "Drag and Drop the subjects that should be analyzed",
    "lst_excluded_subjects": "Drag and Drop the subjects that should be excluded from the analysis",
    "cmb_vendor": "Specify the Vendor of the scans in the analysis folder",
    "cmb_sequencetype": "Specify the imaging sequence utilized during scan acquisition",
    "cmb_labelingtype": "Specify the labelling strategy used during ASL scan acquisition",
    "cmb_m0_isseparate": "Specify whether a proton density scan (M0) was acquired\nIf a scan was not acquired, the mean control ASL image set\nwill be used as a substitute.",
    "cmb_m0_posinasl": "If a proton density (M0) scan was acquired, specify its location.\nThis argument is ignored if the user has indicated that an M0 scan\nwas not acquired",
    "cmb_quality": "Indicate the precision with which certain processing steps should be taken, such\nas segmentation. Higher quality results in longer processing times.",
    "cmb_nsup_pulses": "Specify the number of background suppression pulses that were utilized\nfor ASL scans in your study",
    "cmb_readout_dim": "Specify the dimension of ASL acquisitions as they came off the scanner",
    "le_sup_pulse_vec": "Specify a vector containing the timings, in seconds,\nof the background suppression pulses before the\nstart of the readout. For multiple pulses,\nseparate numbers entires by a comma.\n\nExample: 1.14, 2.55",
    "spinbox_initialpld": "Specify the time, in milliseconds, of the post-label delay.\n- For 3D scans this is fixed for the whole brain\n- For 2D scans this is the post-label delay of the FIRST acquired slice",
    "spinbox_labdur": "Specify the time, in milliseconds, of the pulse labeling period.",
    "spinbox_slice_readout": "Specify the value of the time added to the PLD after each slice\nThis is required for 2D readout ASL acquisitions",
    "spinbox_lambda": "Specify the blood/brain water coefficient (0.9 in Alsop MRM 2014)",
    "spinbox_artt2": "Specify the T2* of the arterial blood at 3T",
    "spinbox_bloodt1": "Specify the T1 relaxation time of arterial blood at 3T (1650 in Alsop MRM 2014)",
    "spinbox_tissuet1": "Specify the T1 relaxation time of grey matter tissue at 3T 1240 in Alsop MRM 2014)",
    "chk_quant_applyss_asl": "Specify whether to apply scale slopes to the ASL volume (checked)\nor omit this step (unchecked)",
    "chk_quant_applyss_m0": "Specify whether to apply scale slopes to the M0 volume (checked)\nor omit this step (unchecked)",
    "chk_quant_pwi2label": "Specify whether to convert PWI arbitrary units to label units (checked)\nor omit this step (unchecked)",
    "chk_quant_quantifym0": "Specify whether to quantify the M0 arbitrary units (checked)\nor omit this step (unchecked)",
    "chk_quant_divbym0": "Specify whether to perform the division calculation by the M0 image (checked)\nor omit this step (unchecked)",
    "chk_save_cbf4d": "Specify whether to also save the 4D CBF timeseries if the ASL volume was a timeseries (checked)\n or omit this step (unchecked)",
    "cmb_ncomparts": "Specify the number of compartments to model during quantification",
    "cmb_m0_algorithm": "Specify whether to use the newer M0 processing algorithm or the standard one",
    "spinbox_gmscale": "Specify whether the M0 image should be multiplied by a specific factor.\nThis is useful when you have background suppression but no M0 image acquired\nwithout suppression. If you know the M0 scalefactor, you can use the control\nimage as M0 and apply this factor to scale back what was suppressed by the\nbackground suppression",
    "chk_removespikes": "Specify whether images that are motion outliers should be\ndiscarded (checked) or left alone (unchecked)",
    "spinbox_spikethres": "Specify the minimum T-statistic required to define a motion spike",
    "chk_motioncorrect": "Specify whether to perform motion correction on the\nASL timeseries (checked) or omit this step (unchecked)",
    "chk_deltempfiles": "Specify whether to delete temporary files created\nduring a pipeline (checked) or retain them (unchecked)",
    "chk_skipnoflair": "Specify whether to omit the processing of any subjects\nmissing FLAIR acquisitions (checked) or proceed anyway (unchecked)",
    "chk_skipnoasl": "Specify whether to omit the processing of any subjects\nmissing ASL acquisitions (checked) or proceed anyway (unchecked)",
    "chk_skipnom0":  "Specify whether to omit the processing of any subjects\nmissing M0 acquisitions (checked) or proceed anyway (unchecked)",
    "cmb_segmethod": "Specify which underlying software to use during T1 image segmentation",
    "chk_runlongreg": "Specify whether to run Longitudinal Registration (checked)\nor stick to cross-sectional (unchecked)",
    "chk_run_dartel": "Specify whether to run the DARTEL algorithm (checked)\nor omit this step (unchecked)",
    "chk_hammersroi": "Specify whether CAT12 should provide Hammers volumetric ROI results (checked)\nor omit this step (unchecked)",
    "chk_fixcat12res": "Specify whether image need to be resampled to a resolution that CAT12 (checked)\nor not (unchecked)",
    "cmb_imgcontrast": "Specify which image contrast is used for registration",
    "cmb_affineregbase": "Specify if the ASL-T1w rigid-body registration is followed up by an affine registration:\n1) Based on PWI CoV - affine registration is conditionally enabled based on the spatial CoV of the PWI\n2) Enabled - affine registration is always enabled\n3) Disabled - affine registration is always disabled",
    "cmb_dctreg": "Specify whether to use DCT registration on top of affine registration",
    "chk_regm0toasl": "Specify whether, if a separate M0 is available, to\nregister it to the mean control ASL image",
    "chk_usemniasdummy": "Specify whether, if a T1w image is missing, to\nutilize the MNI template as a stand-in (checked)\nor omit this (unchecked)",
    "chk_nativepvc": "Perform PV-Correction (checked) in ASL native space using the GM and WM maps\nobtained from previously segmented T1-weighted images.\nOtherwise, omit this step (unchecked)",
    "chk_gaussianpvc": "PV-correction with a Gaussian (checked) instead of square kernel (unchecked)",
    "spinbox_pvckernel_1": "Size of the kernel's first dimension, in voxels",
    "spinbox_pvckernel_2": "Size of the kernel's second dimension, in voxels",
    "spinbox_pvckernel_3": "Size of the kernel's third dimension, in voxels",
    "le_fslpath": "Specify the path to the FSL bin directory\n(i.e. /usr/local/fsl/bin/fsl",
    "chk_suscepmask": "Specify whether to mask an ROI using the susceptibility mask (checked)\n or omit this step (unchecked)",
    "chk_subjectvasmask": "Specify whether to mask an ROI using the subject's vascular mask (checked)\nor omit this step (unchecked)",
    "chk_subjecttismask": "Specify whether to mask an ROI using the subject's tissue mask (checked)\nor omit this step (unchecked)",
    "chk_wholebrainmask": "Specify whether to mask an ROI using the subject's wholebrain mask (checked)\nor omit this step (unchecked)",
    "btn_make_parms": "Generates the DataPar.json file",
    "btn_load_parms": "Loads in an existent DataPar.json file to auto-fill in all avaliable widgets"
  },
  "Executor": {
    "inner_cmb_ncores": "Specify the number of cores to allocate to this study.\nImportant points:\n\t-DO NOT specify more cores than there are subjects for the study\n\t-DO NOT specify more than one core for a study that will have the \n\tPopulation Module run on it",
    "inner_le": "Specify the filepath to the root folder of your study.\nFor example: /home/jsmith/MyStudy/derivatives",
    "inner_cmb_procopts": "Specify which ExploreASL module to run:\n\t-Structural: Structural Module for processing T1w and FLAIR scans\n\t-ASL: ASL Module for processing ASL and M0 scans\n\t-Both: Run both the Structural and ASL modules\n\t-Population: Population module for determining statistics,\n\tstudywide masks, etc.",
    "cmb_modjob": "Specify the type of re-run or pre-processing modification you'd like to perform.\nCurrently the following options are avaliable:\n\t'Re-run a study': Re-run parts of a previously-run study\n\t'Alter participants.tsv': Add metadata to the tsv file such that biasfields for\n\tthat metadata may be created when running the Population module",
    "Modjob_RerunPrep": {
      "lock_tree": "Indicate which parts of the pipeline should be re-run for which \nmodules/subjects/runs/etc.\nThis window will delete all created .status files with the lock\ndirectory for the selected folders & files. When ExploreASL is\nre-run, it will detect these missing .status files and interpret\nthat as a signal to re-run that particular section of the study's\npipeline."
    },
    "Modjob_MergeDirs": {
      "spin_nsrcdirs": "Indicate the number of studies that should be merged together.",
      "chk_symlinks": "Indicate whether the merge directory should be real directories (unchecked) or symbolic pointers to real files (checked).\nThe latter saves diskspace at the detriment of depending on the original file existing.",
      "chk_overwrite": "Indicate whether existing files in the merge destination should be overwritten during the merge operation (checked) or skipped (unchecked).",
      "le_mergedst": "Indicate the path to the merge directory.\nFor example: /home/jsmith/MergeStudies/derivatives",
      "btn_mergedirs": "Merge indicated analysis directories together",
      "le_studypath": "Specify the filepath to the root folder of your study.\nFor example: /home/jsmith/MyStudy/derivatives"
    },
    "Modjob_ModSidecars": {
      "le_fromfile": "Indicate the path to the .csv or .tsv file specifying key-values to insert\ninto the json sidecars of subjects specified within said file",
      "lst_subs": "Drag and Drop the directories of the subjects whose sidecars\nshould be altered with the user-specified key and value",
      "le_key": "The key (i.e. M0_GMScaleFactor) that should be inserted into json sidecars",
      "le_value": "The value that the indicated key within the json sidecar should take on",
      "cmb_actiontype": "The specific action the user wishes to perform on the json sidecars"
    },
    "Modjob_TSValter": {
      "le_metadatafile": "Indicate the path to the metadata file (.csv, .tsv, or .xlsx)\nwhose values should be transferred into participants.tsv",
      "btn_loadmetadata": "This will load in the metadata from the metadata file\nand display the column names within the list widget below",
      "lst_metadata": "These are the column names detected in the metadata file.\nDrag and drop the columns whose data should be transferred\ninto the adjacent participants.tsv list widget",
      "le_metadata_subjectcol": "This must be the name of the column describing\nsubjects in the metadata file",
      "lst_parttsv": "These are the column names that will be saved to participants.tsv\nDrag and drop the column names from the metadata list widget\ninto this list widget to indicate which columns of\nmetadata should be transferred",
      "le_parttsv_subjectcol": "This must be the name of the column describing\nsubjects in the participants.tsv file",
      "btn_reset": "This will restore all columns moved from the metadata list\nto the participants.tsv list back to their original position",
      "btn_altertsv": "This will alter participants.tsv with the new data from the metadata file",
      "btn_revert": "In the event that the user wishes to completely undo a participants.tsv\nalteration, this will consume the backup participants_orig.tsv in order\nto restore the original."
    }
  },
  "Plotting": {
    "le_analysis_dir": "Specify the filepath to the root folder of your study.\nFor example: /home/jsmith/MyStudy/derivatives",
    "le_metadata": "Specify the filepath to the metadata file. This should be either a .csv, .tsv. or .xlsx file",
    "cmb_atlas_selection": "Select which atlas the CBF values should be based on",
    "cmb_pvc_selection": "Select whether the CBF values should be based on\npartial-volume correction or uncorrected",
    "btn_subset_data": "This will open a window to allow you to subset the loaded data on based on\nlevels in a categorical variable",
    "btn_indicate_dtype": "This will open a window to allow you to correct the program's\ninterpretation of the datatype of a particular variable\n(i.e Sex encoded by 1s and 0s may be misinterpreted as a numerical type)",
    "btn_load_in_data": "This will load in the data from the indicated analysis directory",
    "lst_varview": "This area houses the variables extracted from column headers found within the\nstudy's dataframes as well as any metadata loaded in by the user",
    "cmb_figuretypeselection": "This will select the type of plotting submodule to use.\nOptions include:\n- Facet Grid: for standard plotting (i.e Box Plots)\n- Plot & MRI View: for selecting ASL and T1w scans from datapoints"
  }
}